Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Moreover, the stream processor is respon‐ sible to recover from failures with exactly-once state consistency guarantees and should be capable of adjusting the parallelism of an application.
zh_cn: 此外，它还要负责以精确一次的状态一致性保障进行故障恢复，调节应用并发度等工作。

source: Moreover, the union operator does not perform duplication elimina‐ tion.
zh_cn: 此外，union算子不会对数据进行去重，

source: Moreover, the visibility of committed messages depends on
zh_cn: 此外，已提交消息的可见性会取决于Flink应用生成检查点的间隔。

source: Moreover, the write-ahead operator needs to implement a single method:
zh_cn: 此外，算子还需要实现一个方法：

source: Moreover, they can cause issues if they are used without a custom trigger that discards incomplete and stale windows at some point.
zh_cn: 此外，如果没有为其自定义触发器来丢弃在某些时候出现的不完整或过期的窗口，还会导致一些问题。

source: Moreover, this approach can suffer from garbage collec‐
zh_cn: 此外，该方法可能由于堆中放置了过多常驻内存的对象（long-lived object）而引发垃圾回收停顿（garbage collection pause）问题。

source: Moreover, users of open source software request or contribute new features that are missing to support their use
zh_cn: 此外，开源软件用户如果发现某些功能无法满足用例需求，都会向开源社区汇报或亲自操刀上阵。

source: Moreover, you can submit applications using the Flink CLI client (./bin/flink) and access the REST interface to request information about the Flink cluster or manage running applications.
zh_cn: 此外，你还可以使用Flink的CLI客户端（./bin/flink）提交应用，并访问REST接口获取有关Flink集群的信息或管理正在运行的应用。

source: Moreover, you need to adjust Flink’s configuration file ./conf/flink-conf.yaml and con‐ figure the number of application restart attempts:
zh_cn: 此外，你需要在./conf/flink-conf.yaml中配置应用尝试重启的最大次数：

source: Moreover, you need to set the ImagePullPolicy in the YAML files to Never to ensure Minikube fetches the image from its own registry.
zh_cn: 此外，你还需要将YAML文件中的ImagePullPolicy设置为Never，以确保Minikube从自己的注册表中获取镜像。

source: More‐ over, applications that read from the sink system might observe unexpected results during the time when an application recovers.
zh_cn: 此外，从下游数据汇系统中读取数据的应用可能会在应用恢复期间观察到异常结果。

source: More‐ over, exactly-once state consistency and the ability to scale an application are funda‐ mental requirements for event-driven applications.
zh_cn: 此外，作为基本需求，系统要提供精确一次（exactly-once）的状态一致性保障和针对应用的可伸缩性。

source: More‐ over, in combination with the CheckpointListener interface, the snapshotState() method can be used to consistently write data to external datastores by synchronizing
zh_cn: 此外，该方法还可以结合CheckpointListener接口使用，以和Flink检查点同步的方式将数据持续写入外部数据存储中。

source: More‐ over, the data often needs to be transformed into a common format.
zh_cn: 此外，开发人员还经常需要将这些数据转换为某种通用格式。

source: More‐ over, the deployment configures which ports of the container to open for RPC com‐
zh_cn: 此外该Deployment配置了容器需要开放哪些用于RPC通信、

source: Most DataStream API methods accept lambda functions.
zh_cn: 大多数DataStream API的方法都接收Lambda函数。

source: Most commonly, this is done in a static
zh_cn: 大多数情况下，这些工作都会在静态的main()方法中完成。

source: Most function interfaces are designed as SAM (single abstract method) interfaces and they can be implemented as Java 8 lambda functions.
zh_cn: 大多数函数接口都被设计为SAM（single abstract method 单一抽象方法）形式的，因此可以通过Java 8的Labmda函数实现。

source: Most of these features are based on savepoints.1 Flink exposes the following interfaces to monitor and control its master and worker processes, and applications:
zh_cn: 这些功能大都基于保存点机制。1 为了对主进程、工作进程以及应用进行监控，Flink对外公开了以下接口：

source: Most operators of the DataStream API have a single output—they produce one result stream with a specific data type.
zh_cn: 大多数DataStream API的算子都只有一个输出，即只能生成一条具有某种数据类型的结果流。

source: Most stream transformations are based on user-defined functions.
zh_cn: 大多数流式转换都是基于用户自定义函数来完成的。

source: Most streaming applications are ideally executed continuously with as little downtime as possible.
zh_cn: 大多数流式应用都会尽可能减少停机时间来连续地执行。

source: Most streaming applications require that failures not affect the correctness of the computed results.
zh_cn: 它们中的绝大多数都要求故障不会对计算结果的正确性产生影响。

source: Multi-Stream Transformations
zh_cn: 基于多流的转换

source: Multiple companies have built streaming analytics services based on Flink’s SQL support both for internal use or to publicly offer them to paying customers.
zh_cn: 很多公司基于此构建了流式分析服务，供内部或外界付费用户使用。

source: Multiplexing records most likely introduces additional out-of-orderness with respect to the event-time timestamps such that a downstream timestamp assigner might produce more late records than expected.
zh_cn: 混合记录有极大可能导致事件时间戳进一步乱序，从而使下游时间戳分配器产生更多的迟到记录。

source: Multistream Transformations
zh_cn: 多流转换

source: Multistream transformations merge multiple streams into one stream or split one stream into multiple streams.
zh_cn: 将多条数据流合并为一条或将一条数据流拆分成多条的多流转换。

source: Nat‐ urally, if a system can perform operations faster, it can perform more operations at the same amount of time.
zh_cn: 显然，系统执行操作越快，相同时间内执行的操作数量就会越多。

source: Naturally, if a system can perform operations faster, it can perform more operations in the same amount of time.
zh_cn: 显然，系统执行操作越快，相同时间内执行的操作数目就会越多。

source: Navigate to File -> New -> Project from Existing Sources, select the book examples folder examples-scala, and click OK.
zh_cn: 依次找到File -> New -> Project from Existing Sources，选择书中示例文件夹examples-scala，点击OK。

source: Nested fields in POJOs and tuples are selected by denoting the nesting level with a "." (period character).
zh_cn: 如需选择POJO和元组中嵌套字段，可以利用"."来区分嵌套级别。

source: Network memory is automatically subtracted from the configured JVM heap size.
zh_cn: 网络内存会自动从配置的JVM堆内存中抽调出来。

source: New distributed stream processing projects are continuously entering the open source stage and are challenging the state-of-the-art with new features and capabilities.
zh_cn: 新的分布式流处理项目不断涌入开源领域，依靠其新特性和新功能向旧有的领先技术发起挑战。

source: New distributed stream processing projects are continu‐ ously entering the open source stage and are challenging the state of the art with new features and capabilities.
zh_cn: 新的分布式流处理项目不断涌入开源领域，依靠其新的功能特性能向旧有的先进技术发起挑战。

source: Next, we use env.setStreamTimeCharacteristic(TimeCharacteristic.EventTime)
zh_cn: 接下来我们使用env.setStreamTimeCharacteristic(TimeCharacteristic.EventTime)

source: Next, let’s run one of the book example applications in your IDE.
zh_cn: 下一步让我们尝试在IDE里运行书中的一个示例程序。

source: Next, we define a timeWindow() transfor‐ mation, which groups the sensor readings of each sensor ID partition into tumbling
zh_cn: 接下来我们通过timeWindow()转换，针对每个传感器ID分区都将读数划分为5秒一次的滚动窗口：

source: Next, we describe the semantics of common window types.
zh_cn: 接下来我们将介绍常见窗口类型的语义。

source: Next, we introduce application designs based on stateful stream processing that exhibit many interesting characteristics and benefits over traditional approaches.
zh_cn: 接下来，我们会介绍基于状态化流处理的应用方法。和传统方法相比，它有很多有趣的特性和优势。

source: Next, we introduce application designs based on stateful stream pro‐ cessing that exhibit many interesting characteristics and benefits over traditional approaches.
zh_cn: 其次，我们会介绍基于状态化流处理的应用设计。和传统设计相比，它有很多有意义的特性及优势。

source: Next, we review the types of guarantees offered by modern stream processors and some mechanisms that systems implement to achieve those guarantees.
zh_cn: 接下来我们回顾一下现代流处理引擎所提供的不同种类的结果保障以及它们相应的实现机制。

source: Next, we review the types of guarantees offered by modern stream processors and some of the mechanisms systems imple‐ ment to achieve those guarantees.
zh_cn: 接下来我们回顾一下现代流处理引擎所提供的不同种类的结果保障以及它们相应的实现机制。

source: Next, we will get to use Flink’s window API, which provides built-in implementations of the most common window types.
zh_cn: 接下面我们会讲到Flink的窗口API，它针对几个最为常用的窗口类型都提供了内置实现。

source: Next, we will guide you through the process of starting a local cluster and executing a first streaming application in order to give you a first impression of Flink.
zh_cn: 接下来为了帮你获得Flink的第一印象，我们将一步步指导你启动本地集群并运行第一个流式应用。

source: Next, you have looked into the requirements of processing infinite streams in parallel and you have realized the importance of latency and throughput for stream applications.
zh_cn: 接下来你了解了并行处理无限流的需求并意识到了延迟和吞吐对于流式应用的重要性。

source: Next, you learned the requirements of pro‐ cessing infinite streams in parallel and saw the importance of latency and throughput for stream applications.
zh_cn: 接下来，你学习了的并行处理无限流的需求，了解了延迟和吞吐对于流式应用的重要性。

source: No action is taken.
zh_cn: 什么都不做。

source: No matter if water‐ marks are user-defined or automatically generated, tracking global progress in a dis‐ tributed system might be problematic in the presence of straggler tasks.
zh_cn: 无论水位线是由用户定义还是自动生成，只要存在落后的任务，追踪分布式系统中的全局进度就可能出现问题，

source: No matter if watermarks are user defined or automatically generated, tracking global progress in a distributed system might be problematic in the presence of straggler tasks.
zh_cn: 无论水位线是由用户定义还是自动生成，只要存在"拖后腿"的任务，追踪分布式系统中的全局进度就可能出现问题，

source: Nodes represent operators and edges denote data dependencies.
zh_cn: 其中节点表示算子，边表示数据依赖。

source: Nodes represent tasks.
zh_cn: 每个节点表示一个任务。

source: Non-chained task execution with dedicated threads and data transport via buffer channels and serialization.
zh_cn: 使用特定线程执行非链接任务，利用缓冲通道及序列化进行数据传输。

source: Nonchained task execution with dedicated threads and data transport via
zh_cn: 利用专用线程执行非链接任务并通过缓冲通道及序列化进行数据传输

source: Nonconsecutive file IDs, the last number in a committed file’s name, do not indicate data loss.
zh_cn: 文件ID（即提交文件名称的最后一个数字）不连续并不代表数据丢失。

source: None of the functions exposes an API to set the time‐ stamps of emitted records, manipulate the event-time clock of a task, or emit watermarks.
zh_cn: 但函数没有暴露相应的API来设置发出记录的时间戳，调整任务的事件时间时钟或发出水位线。

source: Nonetheless, the Data‐ Stream API provides a dedicated SinkFunction interface and a corresponding Rich SinkFunction abstract class.7 The SinkFunction interface provides a single method:
zh_cn: 虽说如此，DataStream API还是为我们提供了一个专门的SinkFunction接口以及它对应的RichSinkFunction抽象类。7 SinkFunction接口内只有一个方法：

source: Nonkeyed windows (also called all-windows in the DataStream API) behave exactly the same, except that they collect all data and are not evaluated in parallel.
zh_cn: 非键值分区窗口（在DataStream API中也称为全量窗口）的行为与之完全相同，只是它们会收集全量数据且不支持并行计算。

source: Nonresettable source Resettable source
zh_cn: 不可重置数据源 可重置数据源

source: Not all stream processors are equally well-suited to run event-driven applications.
zh_cn: 并不是所有的流处理引擎都同等适合来运行事件驱动型应用。

source: Note shipping records in buffers does imply that Flink’s processing model is based on micro-batches.
zh_cn: 但注意，从缓冲区中传输记录并不意味着Flink的处理模型是基于微批次的。

source: Note that Flink does not guarantee that the notifyCheckpointCom plete() method is called for each completed checkpoint.
zh_cn: 注意，Flink不保证对每个完成的检查点都会调用notifyCheckpointComplete()方法。

source: Note that Flink does not implement this naive mechanism.
zh_cn: 值得一提的是，Flink没有实现这种朴素策略，

source: Note that Flink uses TCP connec‐ tions, thus these requirements are guaranteed.
zh_cn: 由于Flink使用的是TCP连接，这些需求都能得以保障。

source: Note that Flink uses TCP connec‐ tions, and thus these requirements are guaranteed.
zh_cn: 由于Flink使用的是TCP连接，上述需求都能满足。

source: Note that GenericWriteAheadSink does not implement the Sink Function interface.
zh_cn: 注意，GenericWriteAheadSink没有实现SinkFunction接口。

source: Note that all operations are done in a nonblocking fashion.
zh_cn: 注意，以上所有操作都是以非阻塞的方式完成。

source: Note that an explicitly specified trigger overrides the existing trig‐ ger and does not complement it—the window will only be evalu‐ ated based on the trigger that was last defined.
zh_cn: 需要注意的是，显式指定的触发器会覆盖已有的触发器而非对其进行补充，这意味着窗口仅会基于最新定义的触发器执行计算。

source: Note that both bounds may be negative.
zh_cn: 注意，两侧边界值都有可能为负。

source: Note that changing the input data type of built-in stateful opera‐ tors, such as window aggregation, time-based joins, or asyncronous functions, often modifies the type of their internal state.
zh_cn: 注意，改变内置状态化算子（例如窗口聚合，基于时间的Join或异步函数）的输入数据类型通常都使它们内部状态的类型发生变化。

source: Note that checkpoint compression is not supported for incremental RocksDB checkpoints.
zh_cn: 请注意，RocksDB增量检查点不支持压缩。

source: Note that guaranteeing the consistency of an application’s state is not the same a guarantee‐ ing consistency of its output.
zh_cn: 请注意，保证应用状态的一致性和保证输出的一致性并不是一回事儿。

source: Note that in PROCESS_ONCE mode, no checkpoints are taken after the filesystem path is scanned and all splits are created.
zh_cn: 注意，PROCESS_ONCE模式下的数据源在扫描完所有文件并创建好输入划分之后，不会生成任何检查点。

source: Note that in standalone mode, only the master process will be terminated and the worker processes will continue to run.
zh_cn: 注意，在独立集群模式下，只有主进程会被终止，其他工作进程将继续运行。

source: Note that it is currently not possible to pass a custom configuration into the Flink Docker images.
zh_cn: 注意，目前Flink Docker镜像还不支持接收自定义配置。

source: Note that keyBy() is different from the distribution transforma‐ tions discussed in this section.
zh_cn: 注意，keyBy()和本节介绍的分发转换不同。

source: Note that mergable triggers may only use state primitives that can be automatically merged—ListState, ReduceState, or Aggrega tingState.
zh_cn: 注意，可合并的触发器只能使用那些可以自动合并的状态原语——ListState，ReduceState或AggregatingState。

source: Note that only key point queries are supported.
zh_cn: 注意，Flink仅能按照单个键值进行查询，

source: Note that shipping records in buffers does imply that Flink’s pro‐ cessing model is based on microbatches.
zh_cn: 请注意，将记录放入缓冲区并不意味着Flink的处理模型就是基于微批次的。

source: Note that some classes are always resolved first in the parent class‐ loader (classloader.parent-first-patterns.default).
zh_cn: 注意，有些类总是会优先在父类加载器（classloader.parent-first-patterns.default）中解析。

source: Note that stateful transformations and keyed aggregates have to be used with care.
zh_cn: 请注意，在使用状态化转换和基于键值的聚合时要格外小心。

source: Note that stream pro‐ cessors can normally only guarantee result correctness for state that lives inside the stream processor itself.
zh_cn: 注意，流处理引擎通常只能保障其自身内部状态结果的正确性。

source: Note that the ListCheckpointed interface is implemented in Java and expects a java.util.List instead of a Scala native list.
zh_cn: 请注意，ListCheckpointed接口是用Java实现的，所以它内部使用的是java.util.List而非Scala原生列表。

source: Note that the Parquet writer is contained in the flink-parquet module, which needs to be added as a dependency.
zh_cn: 请注意，Parquet写入器包含在flink-parquet模块中，因此在使用时需要将其添加到依赖中。

source: Note that the application and the savepoint must be compatible—the application must be able to load the state of the savepoint.
zh_cn: 需要注意的是，应用和保存点必须相互兼容，只有这样应用才能加载保存点内的状态。

source: Note that the choice of a streaming sink affects the end-to-end con‐ sistency of an application, whether the result of the application is provided with at-least once or exactly-once semantics.
zh_cn: 注意，无论应用结果是至少一次语义还是精确一次语义，流式数据汇的选择都将影响应用端到端的一致性（end-to-end consistency）。

source: Note that the concept of a container in YARN is different from a container in Docker.
zh_cn: 注意，YARN中容器的概念和Docker中的不同。

source: Note that the credentials are tied to a Flink cluster and not to a running job;
zh_cn: 注意，授权证书是和Flink集群绑定的，而非某个运行的作业；

source: Note that the job will continue to run if taking the savepoint fails.
zh_cn: 请注意，如果保存点生成失败，作业将继续运行。

source: Note that the keys of both streams should
zh_cn: 注意，就像SQL查询中Join的谓词一样，两条流中的键值类型需要是同一类实体。

source: Note that the new chained task starts with the operator on which the startNewChain() method is called—Map2 in our example.
zh_cn: 请注意，新的链接任务会从调用startNewChain()方法的算子开始，在我们的示例中是Map2。

source: Note that the savepoint does not contain information about opera‐ tor tasks.
zh_cn: 注意，保存点没有包含算子任务的相关信息。

source: Note that the state of an application will be empty if you start it for the first time or do not provide a savepoint or checkpoint to initial‐ ize the state.
zh_cn: 注意，如果你是第一次启动应用，或没有提供保存点（检查点）来初始化状态，那么应用的状态将被设为空。

source: Note that the trigger uses custom state, which is cleaned up using the clear() method.
zh_cn: 注意，该触发器用到了自定义状态并在clear()方法中对其进行了清理。

source: Note that the watermarks of a source instance cannot make pro‐ gress if a partition becomes inactive and does not provide mes‐ sages.
zh_cn: 注意，如果某一分区变成非活跃状态且不再提供消息，那么数据源实例的水位线将无法前进。

source: Note that these failure scenarios do not affect the exactly-once guarantees of the Cassandra sink connector because it performs UPSERT writes.
zh_cn: 注意，这些失败的场景不会影响Cassandra数据汇连接器的精确一次语义保障，因为它执行的是UPSERT写入。

source: Note that this configuration only affects the first reading positions.
zh_cn: 注意，上述配置只会对应用首次启动后的读取位置起作用。

source: Note that this will void any output guarantees of the application.
zh_cn: 但请注意，这样应用将无法提供任何输出保障。

source: Note that to be able to efficiently combine the current state with an event and produce a single value, the aggregation function must be associative and commuta‐ tive.
zh_cn: 注意，为了更有效地合并事件和当前状态、生成单个结果，聚合函数必须是可结合（associative）及可交换（commutative）的。

source: Note that you can customize a window operator by providing a custom trigger or evictor and declaring strategies to deal with late elements.
zh_cn: 你可以通过提供自定义触发器或移除器以及声明迟到元素处理策略的方式来自定义窗口算子，

source: Note that you do not need to provide connection information, as Flink memorized the connection details of the Flink session run‐ ning on YARN.
zh_cn: 请注意，由于Flink会记住在YARN上运行的Flink会话连接详情，所以你无须提供连接信息。

source: Note that you must configure different cluster IDs for all Flink ses‐ sion clusters that connect to the same ZooKeeper cluster.
zh_cn: 注意，连接同一个ZooKeeper集群的所有处于会话模式的Flink集群都必须配置不同的集群ID。

source: Note that you need to start a process that listens on the socket before starting the pro‐ gram.
zh_cn: 注意，在启动程序之前，你需要先启动负责监听套接字的进程。

source: Note that you should avoid using Kryo if possible.
zh_cn: 注意，如果可能请尽量避免使用Kryo。

source: Note that you should design such an operator with efficient state access patterns and effective state cleanup strategies.
zh_cn: 注意，你要设计的算子需要具备高效的状态访问模式及有效的状态清理策略。

source: Note that you should not access keyed state from the processBroadcastEle ment() method of KeyedBroadcastProcessFunction.
zh_cn: 注意，由于广播输入一侧没有指定键值，状态后端无法访问键值分区的状态值，所以你不能从KeyedBroadcastProcessFunction的processBroadcastElement()方法中访问键值分区状态，强行这么做会使状态后端抛出异常。

source: Note: you can also build the JAR file yourself by following the steps on the repo‐ sitory’s README file.
zh_cn: 注意：你也可以根据代码库中README文件的指示自行构建JAR文件。

source: Now let’s quickly discuss what is happening under the hood.
zh_cn: 接下来我们快速看一下程序内部发生了什么。

source: Now open your IDE and import the Maven project.
zh_cn: 现在就可以打开你的IDE，把Maven项目导进去。

source: Now that we have all that knowledge, it’s time to get our hands dirty and start devel‐ oping Flink applications!
zh_cn: 既然我们已经掌握了这么多理论知识，是时候撸起袖子着手开发Flink应用了！

source: Now that you are familiar with the basics of dataflow programming, it’s time to see how these concepts apply to processing data streams in parallel.
zh_cn: 现在你已经对Dataflow编程的基础有所了解，接下来我们看一下如何将这些概念应用到并行数据流处理中。

source: Now that you have become familiar with the basics of dataflow programming, it’s time to see how these concepts apply to processing data streams in parallel.
zh_cn: 现在你已经对dataflow编程的基础有所了解，接下来我们看一下这些概念如何应用于并行数据流处理中。

source: Now that you have learned how to register, define, and group metrics, you might be wondering how to access them from external systems.
zh_cn: 你既然已经学会了如何注册、定义指标并对其分组，那接下来可能就想了解如何从外部系统访问它们。

source: Now you can upload and submit jobs to the Flink cluster running on Kubernetes.
zh_cn: 现在你就能够将作业上传并提交至Kubernetes上的Flink集群。

source: Obviously, the periodic nature of the ETL jobs and reporting queries induce a consid‐ erable latency.
zh_cn: 就是ETL作业和报告查询的周期性会导致相当高的延迟。

source: Of course there is much more to learn about stream pro‐ cessing with Apache Flink and that’s what this book is about.
zh_cn: 当然，关于用Apache Flink进行流处理要学习的知识还有很多，这也正是本书要介绍的内容。

source: Of course, none of this matters if your system cannot guard state against failures.
zh_cn: 当然，如果你的系统无法在故障时保护状态，那一切都是空谈。

source: Of course, there is much more to learn about stream processing with Apache Flink and that’s what this book is about.
zh_cn: 当然，关于用Apache Flink进行流处理要学习的知识还有很多，这也正是本书要介绍的内容。

source: Of course, you can still use processing-time windows and timers if you choose the EventTime time characteristic.
zh_cn: 当然，即便选择EventTime时间特性，你仍然可以使用处理时间窗口和计时器。

source: Often are features of these newcomers being adop‐ ted by more stream processors of earlier generations.
zh_cn: 而这些新特性往往会被更多上一代的流处理引擎所采用。

source: Often, a database system serves multiple applications that sometimes access the same databases or tables.
zh_cn: 很多时候，多个应用会共享同一个数据库系统，有时候还会访问相同的数据库或表。

source: Often, these include frequently used libraries, such as Apache Commons or Google’s Guava.
zh_cn: 这些依赖通常包括一些诸如Apache Commons或Google Guava等常用库。

source: Often, this data was either unstruc‐ tured, i.e., not strictly following a relational schema, or too voluminous to be cost-effectively stored in a relational database system.
zh_cn: 这些数据通常是非结构化（即无法严格匹配关系模式）的，或因数量庞大无法经济高效地存放于关系型数据库系统。

source: Oftentimes there is a need to initialize a function before it processes the first record or to retrieve information about the context in which it is executed.
zh_cn: 很多时候我们需要在函数处理第一条记录之前进行一些初始化工作或是取得有关执行它的上下文信息。

source: On the contrary, in continuously running stream‐ ing jobs, state is durable across events and we can expose it as a first-class citizen in the programming model.
zh_cn: 反之，在持续运行的流式作业中，每次处理事件状态都是持久化的，我们完全可以将其作为编程模型中的一等公民。

source: On the contrary, stateful operators may maintain information about the events they have received before.
zh_cn: 相反，状态化算子可能会维护之前接收的事件信息。

source: On the home screen, you will see an overview of your cluster configuration including the number of TaskManagers, number of configured and available task slots, and run‐ ning and completed jobs.
zh_cn: 在主界面上，你将看到有关集群配置的概览信息，其中包括TaskManager的数量、配置和可用的任务处理槽以及正在运行和已完成的作业。

source: On the left hand side you see a JobGraph - the non-parallel representation of an application - consisting of five operators.
zh_cn: 左侧的JobGraph（非并行化的应用表示）包含了5个算子，

source: On the left-hand side of Figure 3-2 you see a JobGraph—the nonparallel representa‐ tion of an application—consisting of five operators.
zh_cn: 左侧的JobGraph（应用的非并行化表示）包含了5个算子，

source: On the other hand, an append operation is not an idem‐ potent operation, because appending an element multiple times results in multiple appends.
zh_cn: 相反，追加操作（append operation）就不是幂等的，因为多次追加某个元素会导致它出现多次。

source: On the other hand, event time guarantees deterministic results and allows you to deal with events that are late or even out of order.
zh_cn: 事件时间则与之相反，能保证结果的准确性，并允许你处理延迟甚至无序的事件。

source: On the other hand, event time guarantees deterministic results and allows you to deal with events that are late or even out-of-order.
zh_cn: 与之相对的事件时间能保证确定的结果，并允许你处理延迟甚至无序的事件。

source: On the other hand, if watermarks are too relaxed, you have high confidence but you might unnecessarily increase processing latency.
zh_cn: 反之，如果水位线过于宽松，虽然可信度得以保证，但可能会无谓地增加处理延迟。

source: On the other hand, if watermarks are too slow to arrive, you have high confi‐ dence but you might unnecessarily increase processing latency.
zh_cn: 反之，如果水位线到来的太晚，虽然可信度得到了保证，但可能会无谓地增加处理延迟。

source: On the other hand, if you generate very tight watermarks—watermarks that might be larger than the timestamps of some later records—time-based computations might be performed before all relevant data has arrived.
zh_cn: 反之，如果生成的水位线过于紧密，即水位线可能大于部分后来数据的时间戳，那么计算可能会在所有相关数据到齐之前就已触发。

source: On the other hand, knowing about all accidents that have ever happened might not be so interesting in this case.
zh_cn: 此时，我们可能对该位置发生过的所有事故并不感兴趣。

source: On the sink side, data streams are often produced into message queues to make the events available to subsequent streaming applications, written to filesystems for archiving or making the data available for offline analytics or batch applications, or inserted into key-value stores or relational database systems, like Cassandra, Elastic‐ Search, or MySQL, to make the data searchable and queryable, or to serve dashboard applications.
zh_cn: 在数据汇一端，数据流中的事件经常会写入消息队列中，以支撑后续流式应用；或是会写入文件系统，实现归档或支撑后续离线分析及批处理应用；也可以插入到键值存储或数据库系统中（如Cassandra、ElasticSearch或MySQL），以供查询、搜索或仪表盘应用使用。
